Revit 2027 API
FamilyItemFactory.NewControl Method
Add a new control into the Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Control NewControl(
	ControlShape controlShape,
	View view,
	XYZ origin
)
Public Function NewControl (
	controlShape As ControlShape,
	view As View,
	origin As XYZ
) As Control
public:
Control^ NewControl(
	ControlShape controlShape,
	View^ view,
	XYZ^ origin
)
member NewControl :
        controlShape : ControlShape *
        view : View *
        origin : XYZ -> Control
Parameters
controlShape ControlShape
 The shape of the control.
view View
 The view in which the control is to be visible. It must be a FloorPlan view or a CeilingPlan view.
origin XYZ
 The origin of the control.
Return Value
Control
If successful, the newly created control is returned, otherwise an exception with error information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"view" or "position"-is null.
ArgumentException |  Thrown when the input argument-"view"-is invalid.
ArgumentOutOfRangeException |  Thrown when the input argument-"controlType"-is out of range.
InvalidOperationException |  Thrown when control creation failed.
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace